cmsis-svd/cmsis-svd/data/Renesas/R7FA2E1.svd
                <register>
                    <name>ADCMPCR</name>
                    <description>A/D Compare Function Control Register</description>
                    <addressOffset>0x090</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPAB</name>
                            <description>Window A/B Composite Conditions Setting</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Output ADC120_WCMPM when window A OR window B comparison conditions are met. Otherwise, output ADC120_WCMPUM.</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Output ADC120_WCMPM when window A EXOR window B comparison conditions are met. Otherwise, output ADC120_WCMPUM.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Output ADC120_WCMPM when window A AND window B comparison conditions are met. Otherwise, output ADC120_WCMPUM.</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited.</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPBE</name>
                            <description>Compare Window B Operation Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable compare window B operation. 
Disable ADC120_WCMPM and ADC120_WCMPUM outputs. 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable compare window B operation.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPAE</name>
                            <description>Compare Window A Operation Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable compare window A operation. 
Disable ADC120_WCMPM and ADC120_WCMPUM outputs. 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable compare window A operation.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPBIE</name>
                            <description>Compare B Interrupt Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable ADC120_CMPBI interrupt when comparison conditions (window B) are met.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable ADC120_CMPBI interrupt when comparison conditions (window B) are met.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WCMPE</name>
                            <description>Window Function Setting</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable window function 
Window A and window B operate as a comparator to compare the single value on the lower side with the A/D conversion result. 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable window function 
Window A and window B operate as a comparator to compare the two values on the upper and lower sides with the A/D conversion result. 
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPAIE</name>
                            <description>Compare A Interrupt Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable ADC120_CMPAI interrupt when comparison conditions (window A) are met.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable ADC120_CMPAI interrupt when comparison conditions (window A) are met.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPANSER</name>
                    <description>A/D Compare Function Window A Extended Input Select
 Register</description>
                    <addressOffset>0x092</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CMPTSA</name>
                            <description>Temperature Sensor Output Compare Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Exclude the temperature sensor output from the compare Window A
 target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Include the temperature sensor output in the compare Window A target
 range.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPOCA</name>
                            <description>Internal Reference Voltage Compare Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Exclude the internal reference voltage from the compare Window A target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Include the internal reference voltage in the compare Window A target range. 
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPLER</name>
                    <description>A/D Compare Function Window A Extended Input Comparison
 Condition Setting Register</description>
                    <addressOffset>0x093</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CMPLTSA</name>
                            <description>Compare Window A Temperature Sensor Output Comparison Condition Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0) : 
ADCMPDR0 value &gt; A/D-converted valueCompare Window A Temperature Sensor Output Comparison Condition
 Select 
When window function is enabled (ADCMPCR.WCMPE = 1) : 
Compare Window A Temperature Sensor Output Comparison ConditionA/D-converted value &lt; ADCMPDR0 value, 
or A/D-converted value &gt; ADCMPDR1 value 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0) : 
ADCMPDR0 value &lt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1) : 
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value 
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLOCA</name>
                            <description>Compare Window A Internal Reference Voltage Comparison Condition Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0) : 
ADCMPDR0 value &gt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1): 
A/D-converted value &lt; ADCMPDR0 value, 
or A/D-converted value &gt; ADCMPDR1 value 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0): 
ADCMPDR0 value &lt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1): 
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1 value 
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPANSR0</name>
                    <description>A/D Compare Function Window A Channel Select Register
 0</description>
                    <addressOffset>0x094</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPCHAn</name>
                            <description>Compare Window A Channel Select</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable compare function for associated input channel</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable compare function for associated input channel</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPANSR1</name>
                    <description>A/D Compare Function Window A Channel Select Register
 1</description>
                    <addressOffset>0x096</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPCHAn</name>
                            <description>Compare Window A Channel Select</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable compare function for associated input channel</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable compare function for associated input channel</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPLR0</name>
                    <description>A/D Compare Function Window A Comparison Condition Setting
 Register 0</description>
                    <addressOffset>0x098</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPLCHAn</name>
                            <description>Compare Window A Comparison Condition Select</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0): 
ADCMPDR0 value &gt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1): 
A/D-converted value &lt; ADCMPDR0 value, 
or ADCMPDR1 value &lt; A/D-converted value 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0): 
ADCMPDR0 value &lt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1): 
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value 
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPLR1</name>
                    <description>A/D Compare Function Window A Comparison Condition Setting
 Register 1</description>
                    <addressOffset>0x09A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPLCHAn</name>
                            <description>Compare Window A Comparison Condition Select</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0): 
ADCMPDR0 value &gt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1): 
A/D-converted value &lt; ADCMPDR0 value, 
or ADCMPDR1 value &lt; A/D-converted value 
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0): 
ADCMPDR0 value &lt; A/D-converted value 
When window function is enabled (ADCMPCR.WCMPE = 1): 
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value 
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>ADCMPDR%s</name>
                    <description>A/D Compare Function
 Window A Lower-Side/Upper-Side Level Setting Register</description>
                    <addressOffset>0x09C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
